# 様々なタイプのオブジェクトに対してto_sメソッド(オブジェクトの内容を文字列化するメソッド)を呼び出すコード例

# 文字列
'1'.to_s # => "1"

# 数値
1.to_s # => "1"

# nil
nil.to_s # => ""

# true
true.to_s # => "true"

# false
false.to_s # => "false"

# 正規表現
/\d+/.to_s # => "(?-mix:\\d+)"

# 数値の1を文字列に変換する(カッコあり)
1.to_s() # => "1"

# 数値の1を文字列に変換する(カッコなし)
1.to_s # => "1"

# 数値を16進数の文字列に変換する(カッコあり)
10.to_s(16) # => "a"

# 数値を16進数の文字列に変換する(カッコなし)
10.to_s 16 # => "a"

# 改行ごとにメソッドが実行される
1.to_s # => "1"
nil.to_s # => ""
10.to_s(16) # => "a"

# セミコロンを使って、3つの文を1行に押し込める
1.to_s; nil.to_s; 10.to_s(16)

# (で改行しているので、カッコが閉じられるまで改行してもエラーにならない
10.to_s(
  16
)  # => "a"

# (がない場合は10.to_sと16という2つの文だとみなされる
10.to_s # => "10"
16 # => "16"

# バックスラッシュを使って10.to_s 16を改行して書く
10.to_s \
16  # => "a"