# 配列
# 複数のデータをまとめて格納できるオブジェクトのこと

# 空の配列を作る
[]

# 3つの要素が格納された配列を作る
[要素1, 要素2, 要素3]

# 配列はArrayクラスのオブジェクト
# 空の配列を作成し、そのクラス名を確認
[].class # => Array

# 数値の1,2,3が格納された配列を変数aに代入
a = [1, 2, 3]

a = [
  1,
  2,
  3
]

a = [
  1,
  2,
  3,
]

# 配列は数値に限らず、どんなオブジェクトでも格納できる
a = ['apple', 'orange', 'melon']
a = [1, 'apple', 2, 'orange', 3, 'melon']

# 配列の中に配列を含めることも可
a = [[10, 20, 30],[40, 50, 60], [70, 80, 90]]

# 配列の各要素を取得する場合は、[]と添字(数値)を使う。最初の要素の添字は0
a = [1, 2, 3]
# 1つめの要素を取得
a[0] # => 1
# 2つめの要素を取得
a[1] # => 2
# 3つめの要素を取得
a[2] # => 3

# 存在しない要素を指定してもエラーにならず、nilが返る
a = [1, 2, 3]
a[100] # => nil

# sizeメソッドを使うと配列の長さ(要素の個数)を取得できる
a = [1, 2, 3]
a.size   # => 3
a.length # => 3

# 添字を指定して値を代入すると、指定した要素変更すること
配列[添え字] = 新しい値

a = [1, 2, 3]
a[1] = 20
a # => [1, 20, 3]

# 元の大きさよりも大きい添え字を指定すると、間の値がnilで埋められる
a = [1, 2, 3]
a[4] = 50
a # => [1, 2, 3, nil, 50]

# <<を使うと配列の最後に要素を追加することができる
a = []
a << 1
a << 2
a << 3
a # => [1, 2, 3]

# 配列内の特定の位置にある要素を削除したい場合はdelete_atメソッドを使う
a = [1, 2, 3]
# 2番目の要素を削除する(削除した値が戻り値になる)
a.delete_at(1) # => 2
a              # => [1, 3]

# 存在しない添え字を指定するとnilが返る
a.delete_at(100) # => nil
a                # => [1, 3]


# 配列を使った多重代入
a, b = [1, 2]
a # => 1
b # => 2

# 右辺の数が少ない場合はnilが入る
c, d = [10]
c # => 10
d # => nil

# 右辺の数が多い場合ははみ出した値が切り捨てられる
e, f = [100, 200, 300]
e # => 100
f # => 200

# divmodはしょうと余りを配列で返す
14.divmod(3) # => [4, 2]    14割る3

# 戻り値を配列のまま受け取る
quo_rem = 14.divmod(3)
"商=#{quo_rem[0]}, 余り=#{quo_rem[1]}" # => "商=4, 余り=2"

# 多重代入で別々の変数として受け取る
quotient, remainder = 14.divmod(3)
"商=#{quotient}, 余り=#{remainder}"    # => "商=4, 余り=2"